"""Создать два объекта класса Dog. Вывести их на экран"""

class dog():
    def __init__(self):
        print('Объект создан')

a = dog()
b = dog()