"""Создать матрицу с 0 внутри, и 1 на границах"""
import numpy as np

Z = np.ones((10,10))
Z[1:-1, 1:-1] = 0

print(Z)