"""Создать 3x3 единичную матрицу"""

import numpy as np

a = np.ones([3,3],"f")
print(a)